In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [5]:
dframe = DataFrame({'key1':['A']*2 + ['B']*3,
                   'key2':[2,2,2,3,3]})
dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [7]:
dframe.duplicated()
# tell us where values are duplicated

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [8]:
dframe.drop_duplicates()
# drop the duplicates

  key1  key2
0    A     2
2    B     2
3    B     3

In [11]:
dframe.drop_duplicates(['key1'])
# dropping duplicates that are on key1 column

  key1  key2
0    A     2
2    B     2

In [14]:
dframe.drop_duplicates(['key1'],keep = 'last')
# drop duplicates while keeping the last one

  key1  key2
1    A     2
4    B     3